E1mpire/HelloMaker-STM32/User/main.cpp
}

bool IsEnterProjectMode1(void)
{
   bool ProjectMode;
   ProjectMode = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8);
   return !ProjectMode;

}

#endif

double dl_map(double x, double in_min, double in_max, double out_min, double out_max)
{
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

long map(long x, long in_min, long in_max, long out_min, long out_max)
{
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

char Uploaddate[13] = {0x21,0x21,0x0a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};
int Upcheck_dat = 0;
int t=0;
int current_rpm1;
int current_rpm2;
int pwm1 =0,pwm2=0;
#define MOTOR_REVERSE  0


void getVelocities()
{ 
  #if TS50 || TR400 || TR450  
  current_rpm1 = encoder1.getRPM();
  current_rpm2 = -encoder2.getRPM();
  #elif TR500 || TR600
  current_rpm1 = encoder1.getRPM();
    #if TR500 && !BRUSHLESS
    current_rpm2 = -encoder2.getRPM();
    #else
    current_rpm2 = encoder2.getRPM();
	#endif
  #else
  current_rpm1 = encoder1.getRPM();
  current_rpm2 = encoder2.getRPM();
  #endif
  Kinematics::velocities current_vel;
  current_vel = kinematics.getVelocities(current_rpm1, current_rpm2);//目前只使用了一个码盘，所以两个都是1
  Speed_x = current_vel.linear_x;
  Speed_y = current_vel.linear_y;
  raw_vel_msg.linear_x = current_vel.linear_x;
  raw_vel_msg.linear_y = 0.0;
  raw_vel_msg.angular_z = current_vel.angular_z;
#if UPLOADDATA
  if(current_vel.linear_x > 0){
	 s_Uploadvx = 1;
	 Uploadvx  = current_vel.linear_x*100.0;
	}
  else{ 
	  s_Uploadvx = 0;
      Uploadvx  = -current_vel.linear_x*100.0;
	}

  if(current_vel.angular_z > 0){
	  s_Uploadvz = 1;
      Uploadvz  = current_vel.angular_z*100.0;
	}
  else{ 
	  s_Uploadvz = 0;
      Uploadvz  = -current_vel.angular_z*100.0;
	}
	
    Uploaddate[4] =s_Uploadvx;
	Uploaddate[5] =Uploadvx;
	Uploaddate[6] =0;
	Uploaddate[7] =0;
	Uploaddate[8] =s_Uploadvz;
	Uploaddate[9] =Uploadvz >> 8;
	Uploaddate[10] =Uploadvz & 0xff;
	Upcheck_dat = 0x4c;
    for(int i=4;i< 11;i++)
    	{
           Upcheck_dat+=Uploaddate[i];
	    }
	Uploaddate[11] = Upcheck_dat & 0xFF;
	Uploaddate[12] = Upcheck_dat >> 8;
	for(int i = 0; i < sizeof(Uploaddate); i++){	
		SerialProtocol.write(Uploaddate[i]);
	}
    #endif
}


void move_base()
{
	req_rpm = kinematics.getRPM(required_linear_vel, 0, required_angular_vel);
	#if SBUS_EN 
	    #if SBUS_PID
		if(b_rc_idle == true || Pulsewidth_PID > SBUS_LOW + SBUS_BIAS)
	    #else
		if(b_rc_idle == true)
	    #endif
	#elif IBUS_EN
	  #if IBUS_PID
      if(b_rc_idle == true || Pulsewidth_PID > IBUS_LOW + IBUS_BIAS)
	  #else
	  if(b_rc_idle == true)
	  #endif
	#elif PPM_EN
	  #if PPM_PID
      if(b_rc_idle == true || Pulsewidth_PID > PPM_LOW + PPM_BIAS)
	  #else
	  if(b_rc_idle == true)
	  #endif
	#elif PWM_EN
     if(b_rc_idle == true)
	#endif
	  {
	    #if 1
        if(req_rpm.motor1 == 0 && current_rpm1 == 0)
		 {
	           motor1_pid.clear_pid();
			   motor2_pid.clear_pid();
			   pwm1 = 0;
			   pwm2 = 0;
		  }
	  #if REDUCTION_RATIO <= 5
       else if((req_rpm.motor1 == 0 && req_rpm.motor2 == 0))//&&(abs(current_rpm1 + current_rpm2) < 10))
          { 
             pwm1 /= 1.1;
		     pwm2 /=1.1;
		  }
	  #else 
        else if((req_rpm.motor1 == 0 && req_rpm.motor2 == 0)&&(abs(current_rpm1 + current_rpm2) < 10))
          { 
             pwm1 /= 1.3;
		     pwm2 /=1.3;
		  }
	  #endif
        else{
              pwm1 = motor1_pid.compute(req_rpm.motor1, current_rpm1);
	          pwm2 = motor2_pid.compute(req_rpm.motor2, current_rpm2);
		   }
		 #else
          pwm1 = motor1_pid.compute(req_rpm.motor1, current_rpm1);
	      pwm2 = motor2_pid.compute(req_rpm.motor2, current_rpm2);
		 #endif
	     motor1.spin(pwm1);
         motor2.spin(-pwm2); 

		 
	  } 
}

void stop_base()
{
    #if DECORDE_EN
    required_linear_vel = 0;
    required_angular_vel = 0;
	#else
    required_linear_throttle = 0;
	required_angular_throttle = 0;
	#endif
}


long  encoder1_,encoder2_,_encoder1,_encoder2;
extern uint16 ServoPwmDuty[9];
extern uint32 iii;

void print_debug()
{
    char buffer[100]; 
	static int j = 0;
	u16  DataAddress[2] = {0};
  
	if(j++ == 10)
	{
		j = 0; 

        sprintf(buffer, "r1 =%d, r2= %d \r\n", req_rpm.motor1,req_rpm.motor2);

		sprintf(buffer, "c1 =%d, c2= %d \r\n", current_rpm1,current_rpm2);

	   
		#if 0
        sprintf(buffer, "pwm1 =%d, pwm2 =%d \r\n", abs(pwm1),abs(pwm2));
		SerialProtocol.putstr(buffer);
		sprintf(buffer, "c1 =%d, c2= %d \r\n", current_rpm1,current_rpm2);
		SerialProtocol.putstr(buffer);
		sprintf(buffer, "g_forcestop =%d   UrgencyStop =%d , i =%d", g_forcestop,UrgencyStop,i);
		SerialProtocol.putstr(buffer);

		
        sprintf (buffer, "PulsewidthX: %d  PulsewidthY  %d\r\n", PulsewidthX,PulsewidthY);
		SerialProtocol.putstr(buffer);
		
		_encoder1 =encoder1.read();
		_encoder2 =encoder2.read();
		sprintf (buffer, "Encoder Left:  %ld\r\n", _encoder1);
		SerialProtocol.putstr(buffer);
		sprintf (buffer, "Encoder right:  %ld\r\n", _encoder2);
		SerialProtocol.putstr(buffer);  
		
		sprintf(buffer, "FL_scale =%f, FR_scale= %f \r\n", FL_scale,FR_scale);
		SerialPrint.putstr(buffer);
		
        sprintf(buffer, "r1 =%d, r2= %d \r\n", req_rpm.motor1,req_rpm.motor2);
		SerialProtocol.putstr(buffer);
		sprintf(buffer, "c1 =%d, c2= %d \r\n", current_rpm1,current_rpm2);
		SerialProtocol.putstr(buffer);

		sprintf(buffer, "t1 =%d, t2= %d \r\n", Cur_PC_RX_VALUE,Cur_PC_RY_VALUE);
		SerialProtocol.putstr(buffer);
		#endif
	  }	   
}

int rc_idle_times  = 0;
// ???????????
int Motor_run(int pwm_x,int pwm_y)
{
	//??????????????????????0???????
    unsigned int x = abs(pwm_x);
    unsigned short pwm,pwm_l, pwm_b;
    pwm_b = abs(pwm_y);
   if( pwm_x > STABLE_NUM_X )                                      // right
		{
           if( pwm_y > STABLE_NUM_Y) {                             // front  right    
               pwm_l =  map( 255-abs(pwm_x),15,235,0,abs(pwm_y));  //15
               motor1.spin(pwm_b);
			   motor2.spin(-pwm_l); 
			   motor3.spin(pwm_b);
			   motor4.spin(-pwm_l);       
		   }
		   else if(pwm_y < -STABLE_NUM_Y){   // back right  
			   pwm_l =  map(255-abs(pwm_x),15,235,0,abs(pwm_y)); //15
               motor1.spin(-pwm_b);
			   motor2.spin(pwm_l); 
			   motor3.spin(-pwm_b);
			   motor4.spin(pwm_l); 
		   	}
           else{		   	  
		   	        pwm = map(x,20,240,0,240);		
					motor1.spin(pwm);
					motor2.spin(pwm);
					motor3.spin(pwm);
					motor4.spin(pwm);
           	}
		 
