E1mpire/HelloMaker-STM32/User/main.cpp
}

#elif PWM_EN
void pwm_control(void)
{
  if(TIM1CH1_CAPTURE_STA&0X80)//成功捕获了一次高电平
   {
	   temp_x=TIM1CH1_CAPTURE_STA&0X3F;
	   temp_x*=65536; 				   //溢出时间总和
	   temp_x+=TIM1CH1_CAPTURE_VAL;	   //得到的总的高电平时间
	   if(temp_x > 2200)  temp_x = 1500;
	   else if(temp_x < 800)  temp_x = 1500;
	   PulsewidthX = temp_x;
	   TIM1CH1_CAPTURE_STA=0;		   //开启下一次捕获
   }
   if(TIM2CH3_CAPTURE_STA&0X80)//成功捕获到一次高电平
   {
	   temp_y=TIM2CH3_CAPTURE_STA&0X3F;
	   temp_y*=65536; 				   //溢出时间总和
	   temp_y+=TIM2CH3_CAPTURE_VAL;	   //得到总的高电平时间 
	   if(temp_y > 2200)  temp_y = 1500;
	   else if(temp_y < 800)  temp_y = 1500;
	   PulsewidthY = temp_y;
	   TIM2CH3_CAPTURE_STA=0;		   //开启下一次捕获
   }
   if(ConnectCheck())return ;
   if(SignalStableCheck())return ;
   RC_Common();
   NonLoopControl(); 
 
}


#elif PPM_EN
void ppm_control(void)
{
  PulsewidthX = ppm_channels[0];
  PulsewidthY = ppm_channels[1];
  Pulsewidth_Power  =  ppm_channels[4];
  Pulsewidth_PID    =  ppm_channels[5];
  
  if(ConnectCheck())return ;
  if(SignalStableCheck())return ;
  RC_Common();
  ProtectSwitch();
  #if PPM_PID
	RcControl();
  #else
	NonLoopControl();
  #endif
}

#endif
void PC_ThrottleControl(void)
{
	if(Goal_PC_RX_VALUE >=240) Goal_PC_RX_VALUE =240;
	else if(Goal_PC_RX_VALUE <=-240) Goal_PC_RX_VALUE = -240;
	if(Goal_PC_RY_VALUE >=240) Goal_PC_RY_VALUE =240;
	else if(Goal_PC_RY_VALUE <=-240) Goal_PC_RY_VALUE = -240;
	if(Goal_PC_RX_VALUE > Cur_PC_RX_VALUE )		  (Goal_PC_RX_VALUE > (Cur_PC_RX_VALUE+step)) ? (Cur_PC_RX_VALUE+=step) : Cur_PC_RX_VALUE++;
	else if(Goal_PC_RX_VALUE < Cur_PC_RX_VALUE)	  (Goal_PC_RX_VALUE < (Cur_PC_RX_VALUE-step)) ? (Cur_PC_RX_VALUE-=step) : Cur_PC_RX_VALUE--;
	if(Goal_PC_RY_VALUE > Cur_PC_RY_VALUE )		  (Goal_PC_RY_VALUE > (Cur_PC_RY_VALUE+step)) ? (Cur_PC_RY_VALUE+=step) : Cur_PC_RY_VALUE++;
	else if(Goal_PC_RY_VALUE < Cur_PC_RY_VALUE)	  (Goal_PC_RY_VALUE < (Cur_PC_RY_VALUE-step)) ? (Cur_PC_RY_VALUE-=step) : Cur_PC_RY_VALUE--;	
    Motor_run(Cur_PC_RX_VALUE,Cur_PC_RY_VALUE); 
}

void TiltAlarm(void)
{
   accel =  readAccelerometer();			   
   pitch = atan2f(accel.y, -accel.z)*57.296;	
   if(pitch > 0 )pitch = 180 -pitch;
   else 		 pitch = 180 +pitch;	 
   if(Pulsewidth_Alarm < 800 || Pulsewidth_Alarm > 2200) Pulsewidth_Alarm = 1500;
   alam_anlge = map(Pulsewidth_Alarm,1000,2000,10,30);
   if(alam_anlge < pitch ) TrigTime++;
   else TrigTime = 0; 
   
   if(TrigTime > 20) Trig = true;		
   else{
	 if(Trig == true)  previous_alarm_time = millis();
	 if(millis()-previous_alarm_time > 1000) Trig  = false; 
	    
   	}
}
void CtrModeShow(void)
{
   #if IBUS_EN
   OLED_ShowString(0,0, "IBUS");
   #elif (SBUS_EN)
   if(REMOTE_CONTROL_FLAG)  OLED_ShowString(0,0, "SBUS"); //遥控控制时的OLED屏幕显示
   #elif PWM_EN
   OLED_ShowString(0,0, "PWM");
   #elif PPM_EN
   OLED_ShowString(0,0, "PPM");

	
   #endif
}


#if BIAS_ADJUST 
void BiasAdjst(void)
{  
   if(FrontAdjust == 1){
	 	   #if IBUS_EN
	       if(Pulsewidth_Bias > 1500)
	       	{	   
	           FR_scale = dl_map(2000-Pulsewidth_Bias,0,500,BIAS_SACLE,1.0) ;
	           FL_scale = 1.0;
		    }
	       else if(Pulsewidth_Bias <= 1500)
	       	{
			   FR_scale = 1.0;
	           FL_scale = dl_map(Pulsewidth_Bias-1000,0,500,BIAS_SACLE,1.0) ;	          
		    }    
            #elif SBUS_EN

			 #if FUTABA
             if(Pulsewidth_Bias > 1000)
	       	{	   
	           FR_scale = dl_map(1200-Pulsewidth_Bias,0,200,BIAS_SACLE,1.0) ;
	           FL_scale = 1.0;
		    }
	       else if(Pulsewidth_Bias <= 1000)
	       	{
			   FR_scale = 1.0;
	           FL_scale = dl_map(Pulsewidth_Bias-800,0,200,BIAS_SACLE,1.0);	          
		    }
		    #elif SIYI || FLYSKY || YUNZHUO
             if(Pulsewidth_Bias > 992)
	       	{	   
	           FR_scale = dl_map(1712-Pulsewidth_Bias,0,720,BIAS_SACLE,1.0) ;
	           FL_scale = 1.0;
		    }
	        else if(Pulsewidth_Bias <= 992)
	       	{
			   FR_scale = 1.0;
	           FL_scale = dl_map(Pulsewidth_Bias-272,0,720,BIAS_SACLE,1.0);	          
		    }
			#endif
			#endif
     	}  
     if(BackAdjust == 1){
	 	     #if IBUS_EN
			 if(Pulsewidth_Bias > 1500)
			   {	 
				 BR_scale = dl_map(2000-Pulsewidth_Bias,0,500,BIAS_SACLE,1.0);
				 BL_scale = 1.0;
			  }
			 else if(Pulsewidth_Bias <= 1500)
			  {
				 BR_scale = 1.0;
				 BL_scale = dl_map(Pulsewidth_Bias-1000,0,500,BIAS_SACLE,1.0);		
			  }
			 #elif SBUS_EN

			  #if FUTABA
              if(Pulsewidth_Bias > 1000)
			   {	 
				 BR_scale = dl_map(1200-Pulsewidth_Bias,0,200,BIAS_SACLE,1.0);
				 BL_scale = 1.0;
			  }
			 else if(Pulsewidth_Bias <= 1000)
			  {
				 BR_scale = 1.0;
				 BL_scale = dl_map(Pulsewidth_Bias-800,0,200,BIAS_SACLE,1.0);		
			  }
			 #elif SIYI || FLYSKY || YUNZHUO
              if(Pulsewidth_Bias > 992)
			   {	 
				 BR_scale = dl_map(1712-Pulsewidth_Bias,0,720,BIAS_SACLE,1.0);
				 BL_scale = 1.0;
			  }
			 else if(Pulsewidth_Bias <= 992)
			  {
				 BR_scale = 1.0;
				 BL_scale = dl_map(Pulsewidth_Bias-272,0,720,BIAS_SACLE,1.0);		
			  }
			 #endif
			 #endif
	     }
	 
}

void BiasadjustSave(void)
{
    if(FrontAdjust == 1 && IsEnterProjectMode1() == false)
      {      
		 DataAddress[0] = Pulsewidth_Bias;
	     STMFLASH_Write(WRITE_FRONT_ADDR,(u16*)DataAddress,SIZE);
	     led.on_off(true);
		 delay(500);
		 led.on_off(false);
		 FrontAdjust = 0;
		 SerialProtocol.putstr("FrontSave");	  
	  }
    if(BackAdjust == 1 && IsEnterProjectMode2() == false)
   	{
		DataAddress[0] = Pulsewidth_Bias;
	    STMFLASH_Write(WRITE_BACK_ADDR,(u16*)DataAddress,SIZE);
		BackAdjust = 0; 
		led.on_off(true);
		delay(500);
		led.on_off(false);   
		SerialProtocol.putstr("BackSave");	
    }

}

void Bias_check(void)
{
	ProjectModeGpioInit();
	if(IsEnterProjectMode1() == true)
	   {
		  FrontAdjust = 1;
		  SerialProtocol.putstr("FrontAdjust");	  
	   }
	if(IsEnterProjectMode2() == true)
	   {
		  BackAdjust = 1; 
		  SerialProtocol.putstr("BackAdjust");
	   }
	if(FrontAdjust == 0)
	{
		 STMFLASH_Read(READ_FRONT_ADDR,(u16*)DataAddress,SIZE);
		 f_bias = DataAddress[0];
		 #if IBUS_EN
		 if(f_bias > 2000) f_bias = 1500;
		 else if(f_bias < 1000) b_bias = 1500;
		 if(f_bias > 1500)
		  { 	
			FR_scale = dl_map(2000-f_bias,0,500,BIAS_SACLE,1.0);
			FL_scale = 1.0;
		  }
		 else if(f_bias <= 1500)
		  {
			FR_scale = 1.0;
			FL_scale = dl_map(f_bias-1000,0,500,BIAS_SACLE,1.0);			   
		  }  

