E1mpire/HelloMaker-STM32/User/main.cpp
		 #elif SBUS_EN
			 #if FUTABA
	         if(f_bias > 1200) f_bias = 1000;
				 else if(f_bias < 800) b_bias = 1000;
				 if(f_bias > 1000)
				  { 	
					FR_scale = dl_map(1200-f_bias,0,200,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 1000)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-800,0,200,BIAS_SACLE,1.0);			   
				  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(f_bias > 1800) f_bias = 992;
				 else if(f_bias < 200) b_bias = 992;
				 if(f_bias > 992)
				  { 	
					FR_scale = dl_map(1712-f_bias,0,720,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 992)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-272,0,720,BIAS_SACLE,1.0);			   
				  } 
			 #endif
		 #endif
			
	}
     if( BackAdjust == 0)
	  {
		STMFLASH_Read(READ_BACK_ADDR,(u16*)DataAddress,SIZE);
		b_bias = DataAddress[0];

		#if IBUS_EN
			if(b_bias > 2000) b_bias = 1500;
			else if(b_bias < 1000) b_bias = 1500;
			if(b_bias > 1500)
			  { 	
				BR_scale = dl_map(2000-b_bias,0,500,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1500)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-1000,0,500,BIAS_SACLE,1.0);	   
			  }   
		 #elif SBUS_EN

		     #if FUTABA
	         if(b_bias > 1200) b_bias = 1000;
			 else if(b_bias < 800) b_bias = 1000;
			 if(b_bias > 1000)
			  { 	
				BR_scale = dl_map(1200-b_bias,0,200,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1000)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-800,0,200,BIAS_SACLE,1.0);	   
			  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(b_bias > 1800) b_bias = 992;
			 else if(b_bias < 200) b_bias = 992;
			 if(b_bias > 992)
			  { 	
				BR_scale = dl_map(1712-b_bias,0,720,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 992)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-272,0,720,BIAS_SACLE,1.0);	   
			  } 
			 #endif
		 #endif
	  }
}

#endif

#if SERVO_EN
void TaskTimeHandle(void)
  {
	static uint32 time = 20;
	if(gSystemTickCount > time)
	  {
		  time += 20;
		  ServoPwmDutyCompare();		
	  }
   }
#endif
int Battery_Capacity=50;
char battery_buffer[15]= "Battery ";
/*
*电量报告函数，调用后用LoRa串口发送电量信息
*/
void BatteryReport(void)
{
	Battery_Capacity = bat.get_battery_precent();//读取电池电量
	battery_buffer[8] = (char)('0'+Battery_Capacity/10); //电量百分比的十位数
	battery_buffer[9] = (char)('0'+Battery_Capacity%10); //电量百分比的个位数

	drv_uart_tx_bytes((uint8_t*)battery_buffer,10);
}
/*
----------------------------------------------------------------------------------
*/
// LoRa通信参数设置

char Remote_on[10] = "12345678";  //转换到遥控器控制的指令
char Remote_off[10] = "87654321";  //转换到程序控制的指令
char LR_Adjust[10] = "44444444";
char Goto_A[10] = "Go to A"; //前往泊车点的指令
char Goto_B[10] = "Go to B"; //前往停车点1的指令
char Goto_C[10] = "Go to C"; //前往停车点2的指令
char Set_A[10] = "Set A";    //将当前位置设置为泊车点并重置状态
char Set_B[10] = "Set B";    //将当前位置设置为停车点1并重置状态
char Set_C[10] = "Set C";    //将当前位置设置为停车点2并重置状态
char Report[10] = "Report";  //报告当前位置
char Battery_Report[15] = "BatteryReport";//报告电池电量
char Velocity_Number[7];
char HighSpeed[10] = "HighSpeed";
char LowSpeed[10] = "LowSpeed";
char SlowSpeed[10] = "SlowSpeed";
int command = 1;     //要输入的目的地，只有当车停稳后才会输入
extern int current_command = 1;	//当前履带车正在前往的目的地
uint8_t LoRa_buffer[100] = {0};
uint8_t RxLength = 0;
char *Remote_message =  "RemoteControl\n";
char *Self_message = "SelfControl\n";
char *error_message= "Command in wrong format!\n";

/*---------------------------------------------------------------------------*/
int main(void) 
{

	
	bool OnOff = false;
    char buffer[50];
	// 计量执行时间的参数初始化
    uint32_t publish_vel_time = 0;
	uint32_t previous_imu_time = 0;
	uint32_t previous_oled_time = 0;
	uint32_t previous_led_time = 0;
    uint32_t previous_debug_time = 0;
	uint32_t previous_motorprotec_time = 0;
	uint32_t previous_control_time = 0;
	uint32_t previous_battery_debug_time = 0;
	

	SystemInit();
	initialise();
	motor1.init();
	motor2.init();
	motor3.init();
	motor4.init();
	motor1.spin(0);
	motor2.spin(0);
	motor3.spin(0);
	motor4.spin(0);
	encoder1.init();
	encoder2.init();
	led.init();
	bat.init();
	#if RELAY_EN
	SwitchGpioInit();
   // Switch(0,FALSE);
	#endif
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,ENABLE);	  
	//-------JTAG------
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable,ENABLE);

	#if OLED_EN
	OLED_Init();
	#endif

	#if SERVO_EN
	InitPWM();
    InitTimer6();
	#endif

	// Serial烧录初始化
	SerialPrint.begin(115200);
	dlProtocol.begin();
	drv_uart_init(9600);  //LoRa模块初始化，波特率必须是9600
	sonar_init(65535-1,72-1);  //定时器的预分频值和加载值，如果更改，需要在TIM8的IRQ中相应更改
	Track_Init(); //循迹模块初始化
	Init_Route();

    #if IBUS_EN
    SerialBus.begin(115200);
    IBus.begin();

	#elif SBUS_EN
    sBus.begin();// SBUS控制初始化

	#elif PWM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	TIM2_Cap_Init(0xFFFF,72-1);
	#elif PPM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	#endif
    #if BIAS_ADJUST 
    Bias_check();  //偏差检测初始化
	#endif
	// led模块开启
	led.on_off(OnOff);
	//报告履带车位置
	ReportNode();


	/*-------------------------------主循环------------------------------------------*/
	// ?????
	#if 1
	while(1)
	{
		if((millis()-previous_LoRa_time)>=20)
	   {
		/*
		*LoRaͨ通信模块，每20msִ启动溢出
		*/
		RxLength = drv_uart_rx_bytes(LoRa_buffer); //从LoRa接收信息
		if (RxLength != 0) //如果有信息可以接收
		{
			//drv_uart_tx_bytes((uint8_t*)LoRa_buffer,RxLength);
			if (str_cmp(LoRa_buffer,Remote_on))//比较是否与遥控器模式指令一致
			{
				Stop();
				OLED_Clear();
				drv_uart_tx_bytes((uint8_t*)Remote_message, 13);
				REMOTE_CONTROL_FLAG = 1; //进入遥控器模式
			}
			else if (str_cmp(LoRa_buffer,Remote_off))
			{
				Stop();
				OLED_Clear();
				drv_uart_tx_bytes((uint8_t*)Self_message, 11);
				REMOTE_CONTROL_FLAG = 0;//进入程序控制模式
			}
			else if (str_cmp(LoRa_buffer,Goto_A)) //将目的地设定为泊车点
			{
				drv_uart_tx_bytes((uint8_t*)"Gopark\n",6);
				command = 1;
			}
			else if (str_cmp(LoRa_buffer,Goto_B)) //将目的地设定为停车点1
			{
				drv_uart_tx_bytes((uint8_t*)"GoStop1\n",7);
				command = 2;
			}
			else if (str_cmp(LoRa_buffer,Goto_C)) //将目的地设定为停车点2
			{
				drv_uart_tx_bytes((uint8_t*)"Gostop2\n",7);
				command = 3;
			}
			else if (str_cmp(LoRa_buffer,Set_A)) //将履带车位置设置为泊车点
			{
				drv_uart_tx_bytes((uint8_t*)"SetPark\n",7);
				Set_Node(1);
				command = 1;
			}
			else if (str_cmp(LoRa_buffer,Set_B)) //将履带车位置设置为停车点1
			{
				drv_uart_tx_bytes((uint8_t*)"SetStop1\n",8);
				Set_Node(2);
				command = 2;
			}
			else if (str_cmp(LoRa_buffer,Set_C)) //将履带车位置设置为停车点2
			{
				drv_uart_tx_bytes((uint8_t*)"Setstop2\n",8);
				Set_Node(3);
				command = 3;
			}
			else if (str_cmp(LoRa_buffer,LR_Adjust))//看看左右轮速度一不一样
			{
				Lowspeed_Forward();
			}
			else if (str_cmp(LoRa_buffer,Report)) //报告位置
			{
				ReportNode();
			}
			else if (str_cmp(LoRa_buffer,Battery_Report)) //报告电量
			{
				BatteryReport();
			}
			else if (str_cmp(LoRa_buffer,HighSpeed))
			{
				SpeedGear = 2;
				drv_uart_tx_bytes((uint8_t*)"Shift to HighSpeed",18);
			}
			else if (str_cmp(LoRa_buffer,LowSpeed))
			{
				SpeedGear = 1;
				drv_uart_tx_bytes((uint8_t*)"Shift to MidSpeed",17);
			}
			else if (str_cmp(LoRa_buffer,SlowSpeed))
			{
				SpeedGear = 0;
				drv_uart_tx_bytes((uint8_t*)"Shift to SlowSpeed",18);
			}
			else
			{
				drv_uart_tx_bytes((uint8_t*)error_message, 28);
			}

		previous_LoRa_time = millis();
		}
	   }

	   #if CONNECT_DETEC
       if ((millis() - previous_command_time) >= 250){

		      if(b_rc_idle == true)  stop_base();
         }
	   #endif


        if(((millis() - previous_flysky_time) >= 1000 / IBUS_RATE) && REMOTE_CONTROL_FLAG)
        	{
			/*
			*遥控器控制代码，每1000/40=25ms启动一次
			*/   
        	  #if IBUS_EN
              ibus_control();     
			  #elif SBUS_EN
			  sbus_control();	
			  #elif PWM_EN
              pwm_control();
			  #elif PPM_EN
			  ppm_control();
              #endif
			  #endif
              previous_flysky_time = millis();				  
		    }

		#if (CONNECT_DETEC)
		if ((millis() - previous_command_time) >= 1 && !REMOTE_CONTROL_FLAG){  
			/*
			/程序控制模块，每1ms执行一次
			*/
			
			UltrasonicWave_StartMeasure();
			int Distance=(int)distance;
			
			if (reach_parking) //车是否停稳
			{
				parking(command);//只有当车停稳的时候才开始接收下一个目的地
			}else
			{
				test_control(current_command);
			}
			
			//Lowspeed_Forward();
			//Lowspeed_Forward();	
			previous_command_time = millis();
		}
		if ((millis() - previous_battery_debug_time)>=10000)
		{
			/*
			电源检测模块，每10s执行一次
			*/
			BatteryReport();

			previous_battery_debug_time = millis();
		}
		

		#if 1
        if(((millis() - previous_movebase_time) >= 2000) && (!REMOTE_CONTROL_FLAG))
        	{
			/*
			*由于没有码盘，这个模块是无效的
			*/   
               getVelocities();
			   //current_rpm1 = encoder1.getRPM();
			   //current_rpm2 = encoder2.getRPM();
			   float ForwardVel = GetVelocity(current_rpm1,current_rpm2);
			   if(raw_vel_msg.linear_x>ForwardVel) ForwardVel = (float)raw_vel_msg.linear_x;
				//sprintf(Velocity_Number,"%.3f",ForwardVel*PI/2);
				sprintf(Velocity_Number,"%.3f",ForwardVel);
				char Velocity_Report[15] = "Vel ";
			   strcat(Velocity_Report,Velocity_Number);
			   //drv_uart_tx_bytes((uint8_t*)"Vel ",4);
			   drv_uart_tx_bytes((uint8_t*)Velocity_Report,strlen(Velocity_Report));
			   /*
			   sprintf(Velocity_Report,"%d",(int)encoder1.getRPM());
			   drv_uart_tx_bytes((uint8_t*)"Vel ",4);
			   drv_uart_tx_bytes((uint8_t*)Velocity_Report,strlen(Velocity_Report));
			   
				sprintf(Velocity_Report,"%d",encoder2.getRPM());
				drv_uart_tx_bytes((uint8_t*)"T",1);
				drv_uart_tx_bytes((uint8_t*)Velocity_Report,strlen(Velocity_Report));
				*/  
               previous_movebase_time = millis();	
			   
